; ModuleID = '/home/Jinming/research/aie_project/n2n/Work/aie/24_0/src/24_0.cc'
source_filename = "/home/Jinming/research/aie_project/n2n/Work/aie/24_0/src/24_0.cc"
target datalayout = "e-i8:8:8-i16:16:16-i32:32:32-i64:32:32-f32:32:32-f64:32:32-p:32:32:32:32:8-s0:256:256-a0:8:8-S256-n32:64-v128:32:32-P1-p0:20:32:32:32:8-p1:20:32:32:32:8-p2:20:32:32:32:8-p3:20:32:32:32:8-p4:20:32:32:32:8-p5:20:32:32:32:8-p6:20:32:32:32:8-p7:20:32:32:32:8-p8:20:32:32:32:8-p9:1:32:32:32:32-p10:1:32:32:32:32-p11:1:32:32:32:32-p12:1:32:32:32:32-p13:1:32:32:32:32-p14:1:32:32:32:32-p15:1:32:32:32:32-p16:1:32:32:32:32-p17:1:32:32:32:32-p18:1:32:32:32:32-p19:1:32:32:32:32-p20:1:32:32:32:32-p21:1:32:32:32:32-p22:1:32:32:32:32-p23:1:32:32:32:32-p24:1:32:32:32:32"
target triple = "pdarch-unknown-unknown-elf"

%struct.v8int16 = type { %struct.ipd.custom_type.v16int8.v16int8 }
%struct.ipd.custom_type.v16int8.v16int8 = type { i128 }
%struct.window_internal = type { i32, i32, i8*, i8*, [2 x i8*], i8*, [2 x i8*], i32, i32, [2 x i32] }
%struct.input_window.0 = type { i32, i32, i8*, i8*, [2 x i8*], i8*, [2 x i8*], i32, i32, [2 x i32] }
%struct.output_window.1 = type { i32, i32, i8*, i8*, [2 x i8*], i8*, [2 x i8*], i32, i32, [2 x i32] }
%struct.ipd.custom_type.uint2_t.uint2_t = type { i8 }
%struct.ipd.custom_type.uint1_t.uint1_t = type { i8 }

$_Z4donev = comdat any

$_Z7acquirejj = comdat any

$_ZN12me_primitive7acquireEj7uint1_tj = comdat any

$_ZN7uint1_tC2Ei = comdat any

$_Z7releasejj = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "buf0", scope: !2, file: !58, line: 22, type: !59, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 11.0.0 (sgasip@krachtcs10:ipd/repositories/llvm_ipd 8ae012ed2b4731889ba2efbfb1dacc610b3ce588)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !10, globals: !55, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/Jinming/research/aie_project/n2n/Work/aie/24_0/src/24_0.cc", directory: "/home/Jinming/research/aie_project/n2n/Work/aie")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chessllvmInternal", file: !6, line: 21, baseType: !7, size: 32, elements: !8, identifier: "_ZTS17chessllvmInternal")
!6 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/data/versal_prod/lib/isg/me_chess_llvm.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9}
!9 = !DIEnumerator(name: "chessllvm_reinterpret", value: 0, isUnsigned: true)
!10 = !{!11, !17, !18, !41}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "window_datatype", file: !13, line: 8, baseType: !14)
!13 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/include/adf/window/window_internal.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !15, line: 23, baseType: !16)
!15 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/data/versal_prod/lib/runtime/include/stdint.h", directory: "")
!16 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_window_int16", file: !20, line: 100, baseType: !21)
!20 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/include/adf/window/window.h", directory: "")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_window<short>", file: !20, line: 61, size: 416, flags: DIFlagTypePassByValue, elements: !22, templateParams: !38, identifier: "_ZTS12input_windowIsE")
!22 = !{!23, !24, !25, !27, !28, !32, !33, !34, !35, !36}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !21, file: !20, line: 63, baseType: !7, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !21, file: !20, line: 64, baseType: !7, size: 32, offset: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !21, file: !20, line: 65, baseType: !26, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !21, file: !20, line: 66, baseType: !26, size: 32, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !21, file: !20, line: 67, baseType: !29, size: 64, offset: 128)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 2)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !21, file: !20, line: 68, baseType: !26, size: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !21, file: !20, line: 69, baseType: !29, size: 64, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !20, line: 70, baseType: !7, size: 32, offset: 288)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !21, file: !20, line: 71, baseType: !7, size: 32, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !21, file: !20, line: 75, baseType: !37, size: 64, offset: 352)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !30)
!38 = !{!39}
!39 = !DITemplateTypeParameter(name: "T", type: !40)
!40 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_window_int16", file: !20, line: 110, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "output_window<short>", file: !20, line: 80, size: 416, flags: DIFlagTypePassByValue, elements: !44, templateParams: !38, identifier: "_ZTS13output_windowIsE")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !43, file: !20, line: 82, baseType: !7, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !43, file: !20, line: 83, baseType: !7, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !43, file: !20, line: 84, baseType: !26, size: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !43, file: !20, line: 85, baseType: !26, size: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !43, file: !20, line: 86, baseType: !29, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !43, file: !20, line: 87, baseType: !26, size: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !43, file: !20, line: 88, baseType: !29, size: 64, offset: 224)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !43, file: !20, line: 89, baseType: !7, size: 32, offset: 288)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !43, file: !20, line: 90, baseType: !7, size: 32, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !43, file: !20, line: 94, baseType: !37, size: 64, offset: 352)
!55 = !{!0, !56, !64, !66, !68}
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "buf0d", scope: !2, file: !58, line: 23, type: !59, isLocal: false, isDefinition: true)
!58 = !DIFile(filename: "24_0/src/24_0.cc", directory: "/home/Jinming/research/aie_project/n2n/Work/aie")
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 49152, elements: !62)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "v8int16", file: !6, line: 444, baseType: !61)
!61 = !DIBasicType(name: "v8int16", size: 128, encoding: DW_ATE_unsigned)
!62 = !{!63}
!63 = !DISubrange(count: 384)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "buf1", scope: !2, file: !58, line: 24, type: !59, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "buf1d", scope: !2, file: !58, line: 25, type: !59, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "sync_buffer", linkageName: "_ZL11sync_buffer", scope: !2, file: !58, line: 13, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 256, elements: !73)
!71 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !72)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !{!74}
!74 = !DISubrange(count: 8)
!75 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !76, producer: "clang version 11.0.0 (sgasip@krachtcs10:ipd/repositories/llvm_ipd 8ae012ed2b4731889ba2efbfb1dacc610b3ce588)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !87, splitDebugInlining: false, nameTableKind: None)
!76 = !DIFile(filename: "/home/Jinming/research/aie_project/n2n/aie/n2n_trans1.cc", directory: "/home/Jinming/research/aie_project/n2n/Work/aie/ir")
!77 = !{!78}
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "aie_dm_resource", file: !79, line: 370, baseType: !72, size: 32, flags: DIFlagEnumClass, elements: !80, identifier: "_ZTS15aie_dm_resource")
!79 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/data/versal_prod/lib/me_defines.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86}
!81 = !DIEnumerator(name: "none", value: 0)
!82 = !DIEnumerator(name: "a", value: 1)
!83 = !DIEnumerator(name: "b", value: 2)
!84 = !DIEnumerator(name: "c", value: 3)
!85 = !DIEnumerator(name: "d", value: 4)
!86 = !DIEnumerator(name: "stack", value: 5)
!87 = !{!88, !122, !17, !123}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "T", scope: !90, file: !20, line: 836, baseType: !116)
!90 = distinct !DISubprogram(name: "window_readincr<aie_dm_resource::none>", linkageName: "_ZL15window_readincrIL15aie_dm_resource0EEvP12input_windowIsERs", scope: !20, file: !20, line: 836, type: !91, scopeLine: 836, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !75, templateParams: !114, retainedNodes: !111)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !107}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_window_int16", file: !20, line: 100, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_window<short>", file: !20, line: 61, size: 416, flags: DIFlagTypePassByValue, elements: !96, templateParams: !38, identifier: "_ZTS12input_windowIsE")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !95, file: !20, line: 63, baseType: !7, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !95, file: !20, line: 64, baseType: !7, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !95, file: !20, line: 65, baseType: !26, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !95, file: !20, line: 66, baseType: !26, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !95, file: !20, line: 67, baseType: !29, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !95, file: !20, line: 68, baseType: !26, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !95, file: !20, line: 69, baseType: !29, size: 64, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !95, file: !20, line: 70, baseType: !7, size: 32, offset: 288)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !95, file: !20, line: 71, baseType: !7, size: 32, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !95, file: !20, line: 75, baseType: !37, size: 64, offset: 352)
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16", file: !109, line: 14, baseType: !110)
!109 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/include/adf/window/types.h", directory: "")
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !15, line: 24, baseType: !40)
!111 = !{!112, !113}
!112 = !DILocalVariable(name: "w", arg: 1, scope: !90, file: !20, line: 836, type: !93)
!113 = !DILocalVariable(name: "value", arg: 2, scope: !90, file: !20, line: 836, type: !107)
!114 = !{!115}
!115 = !DITemplateValueParameter(name: "Resource", type: !78, value: i32 0)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "aie_dm_resource_set_t<int16, (aie_dm_resource)0>", file: !117, line: 264, baseType: !118)
!117 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/data/versal_prod/lib/aie_core.h", directory: "")
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !119, file: !117, line: 254, baseType: !40)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aie_dm_resource_set<short, aie_dm_resource::none>", file: !117, line: 252, size: 8, flags: DIFlagTypePassByValue, elements: !120, templateParams: !121, identifier: "_ZTS19aie_dm_resource_setIsL15aie_dm_resource0EE")
!120 = !{}
!121 = !{!39, !115}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "T", scope: !125, file: !20, line: 836, baseType: !116)
!125 = distinct !DISubprogram(name: "window_writeincr<aie_dm_resource::none>", linkageName: "_ZL16window_writeincrIL15aie_dm_resource0EEvP13output_windowIsEs", scope: !20, file: !20, line: 836, type: !126, scopeLine: 836, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !75, templateParams: !114, retainedNodes: !142)
!126 = !DISubroutineType(types: !127)
!127 = !{null, !128, !108}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_window_int16", file: !20, line: 110, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "output_window<short>", file: !20, line: 80, size: 416, flags: DIFlagTypePassByValue, elements: !131, templateParams: !38, identifier: "_ZTS13output_windowIsE")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !130, file: !20, line: 82, baseType: !7, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !130, file: !20, line: 83, baseType: !7, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !130, file: !20, line: 84, baseType: !26, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !130, file: !20, line: 85, baseType: !26, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !130, file: !20, line: 86, baseType: !29, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !130, file: !20, line: 87, baseType: !26, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !130, file: !20, line: 88, baseType: !29, size: 64, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !130, file: !20, line: 89, baseType: !7, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !130, file: !20, line: 90, baseType: !7, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !130, file: !20, line: 94, baseType: !37, size: 64, offset: 352)
!142 = !{!143, !144}
!143 = !DILocalVariable(name: "w", arg: 1, scope: !125, file: !20, line: 836, type: !128)
!144 = !DILocalVariable(name: "value", arg: 2, scope: !125, file: !20, line: 836, type: !108)
!145 = !{i32 7, !"Dwarf Version", i32 4}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{i32 1, !"wchar_size", i32 4}
!148 = !{!"clang version 11.0.0 (sgasip@krachtcs10:ipd/repositories/llvm_ipd 8ae012ed2b4731889ba2efbfb1dacc610b3ce588)"}
!149 = distinct !DISubprogram(name: "main", scope: !58, file: !58, line: 32, type: !150, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !152)
!150 = !DISubroutineType(types: !151)
!151 = !{!72}
!152 = !{!153, !169, !170, !171, !172, !173, !174, !177}
!153 = !DILocalVariable(name: "window_buf0_buf0d", scope: !149, file: !58, line: 34, type: !154)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 416, elements: !167)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "window_internal", file: !13, line: 18, size: 416, flags: DIFlagTypePassByValue, elements: !156, identifier: "_ZTS15window_internal")
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !155, file: !13, line: 20, baseType: !7, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !155, file: !13, line: 21, baseType: !7, size: 32, offset: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !155, file: !13, line: 22, baseType: !26, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !13, line: 23, baseType: !26, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !155, file: !13, line: 24, baseType: !29, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !155, file: !13, line: 25, baseType: !26, size: 32, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !155, file: !13, line: 26, baseType: !29, size: 64, offset: 224)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !13, line: 27, baseType: !7, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !155, file: !13, line: 28, baseType: !7, size: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !155, file: !13, line: 32, baseType: !37, size: 64, offset: 352)
!167 = !{!168}
!168 = !DISubrange(count: 1)
!169 = !DILocalVariable(name: "buf0_ptr", scope: !149, file: !58, line: 35, type: !11)
!170 = !DILocalVariable(name: "buf0d_ptr", scope: !149, file: !58, line: 36, type: !11)
!171 = !DILocalVariable(name: "window_buf1_buf1d", scope: !149, file: !58, line: 38, type: !154)
!172 = !DILocalVariable(name: "buf1_ptr", scope: !149, file: !58, line: 39, type: !11)
!173 = !DILocalVariable(name: "buf1d_ptr", scope: !149, file: !58, line: 40, type: !11)
!174 = !DILocalVariable(name: "index", scope: !149, file: !58, line: 42, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32", file: !109, line: 15, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !15, line: 25, baseType: !72)
!177 = !DILocalVariable(name: "proc_24_0_bounds", scope: !178, file: !58, line: 46, type: !175)
!178 = distinct !DILexicalBlock(scope: !149, file: !58, line: 44, column: 3)
!179 = !{!180, !182}
!180 = distinct !{!180, !181, !"main: window_buf0_buf0d"}
!181 = distinct !{!181, !"main"}
!182 = distinct !{!182, !181, !"main: window_buf1_buf1d"}
!183 = !DILocation(line: 33, column: 18, scope: !149)
!184 = !{!185, !185, i64 0, i64 4}
!185 = !{!186, i64 4, !"int"}
!186 = !{!187, i64 1, !"omnipotent char"}
!187 = !{!"Simple C++ TBAA"}
!188 = !DILocation(line: 34, column: 3, scope: !149)
!189 = !DILocation(line: 34, column: 19, scope: !149)
!190 = !{!180}
!191 = !DILocation(line: 35, column: 3, scope: !149)
!192 = !DILocation(line: 35, column: 21, scope: !149)
!193 = !{!194, !194, i64 0, i64 4}
!194 = !{!186, i64 4, !"any pointer"}
!195 = !DILocation(line: 36, column: 3, scope: !149)
!196 = !DILocation(line: 36, column: 21, scope: !149)
!197 = !DILocation(line: 37, column: 15, scope: !149)
!198 = !DILocation(line: 37, column: 3, scope: !149)
!199 = !DILocation(line: 38, column: 3, scope: !149)
!200 = !DILocation(line: 38, column: 19, scope: !149)
!201 = !{!182}
!202 = !DILocation(line: 39, column: 3, scope: !149)
!203 = !DILocation(line: 39, column: 21, scope: !149)
!204 = !DILocation(line: 40, column: 3, scope: !149)
!205 = !DILocation(line: 40, column: 21, scope: !149)
!206 = !DILocation(line: 41, column: 15, scope: !149)
!207 = !DILocation(line: 41, column: 3, scope: !149)
!208 = !DILocation(line: 42, column: 3, scope: !149)
!209 = !DILocation(line: 42, column: 9, scope: !149)
!210 = !DILocation(line: 43, column: 3, scope: !149)
!211 = !DILocation(line: 46, column: 3, scope: !178)
!212 = !DILocation(line: 46, column: 9, scope: !178)
!213 = !DILocation(line: 46, column: 28, scope: !178)
!214 = !DILocation(line: 48, column: 3, scope: !178)
!215 = !DILocation(line: 48, column: 10, scope: !178)
!216 = !DILocation(line: 52, column: 20, scope: !217)
!217 = distinct !DILexicalBlock(scope: !178, file: !58, line: 49, column: 3)
!218 = !DILocation(line: 52, column: 66, scope: !217)
!219 = !DILocation(line: 52, column: 75, scope: !217)
!220 = !DILocation(line: 52, column: 87, scope: !217)
!221 = !DILocation(line: 52, column: 5, scope: !217)
!222 = !DILocation(line: 53, column: 20, scope: !217)
!223 = !DILocation(line: 53, column: 66, scope: !217)
!224 = !DILocation(line: 53, column: 75, scope: !217)
!225 = !DILocation(line: 53, column: 87, scope: !217)
!226 = !DILocation(line: 53, column: 5, scope: !217)
!227 = !DILocation(line: 54, column: 39, scope: !217)
!228 = !DILocation(line: 54, column: 16, scope: !217)
!229 = !DILocation(line: 54, column: 82, scope: !217)
!230 = !DILocation(line: 54, column: 58, scope: !217)
!231 = !DILocation(line: 54, column: 5, scope: !217)
!232 = !DILocation(line: 58, column: 20, scope: !217)
!233 = !DILocation(line: 58, column: 66, scope: !217)
!234 = !DILocation(line: 58, column: 75, scope: !217)
!235 = !DILocation(line: 58, column: 87, scope: !217)
!236 = !DILocation(line: 58, column: 5, scope: !217)
!237 = !DILocation(line: 59, column: 20, scope: !217)
