; ModuleID = '/home/Jinming/research/aie_project/n2n/aie/n2n_trans2.cc'
source_filename = "/home/Jinming/research/aie_project/n2n/aie/n2n_trans2.cc"
target datalayout = "e-i8:8:8-i16:16:16-i32:32:32-i64:32:32-f32:32:32-f64:32:32-p:32:32:32:32:8-s0:256:256-a0:8:8-S256-n32:64-v128:32:32-P1-p0:20:32:32:32:8-p1:20:32:32:32:8-p2:20:32:32:32:8-p3:20:32:32:32:8-p4:20:32:32:32:8-p5:20:32:32:32:8-p6:20:32:32:32:8-p7:20:32:32:32:8-p8:20:32:32:32:8-p9:1:32:32:32:32-p10:1:32:32:32:32-p11:1:32:32:32:32-p12:1:32:32:32:32-p13:1:32:32:32:32-p14:1:32:32:32:32-p15:1:32:32:32:32-p16:1:32:32:32:32-p17:1:32:32:32:32-p18:1:32:32:32:32-p19:1:32:32:32:32-p20:1:32:32:32:32-p21:1:32:32:32:32-p22:1:32:32:32:32-p23:1:32:32:32:32-p24:1:32:32:32:32"
target triple = "pdarch-unknown-unknown-elf"

%struct.input_window = type { i32, i32, i8*, i8*, [2 x i8*], i8*, [2 x i8*], i32, i32, [2 x i32] }
%struct.output_window = type { i32, i32, i8*, i8*, [2 x i8*], i8*, [2 x i8*], i32, i32, [2 x i32] }

$_Z10cyclic_addIaEPT_S1_iS1_i = comdat any

; Function Attrs: nounwind
define dso_local void @_Z10n2n_trans2P12input_windowIsEP13output_windowIsE(%struct.input_window* %matB, %struct.output_window* %matC) addrspace(1) #0 !dbg !92 {
entry:
  %matB.addr = alloca %struct.input_window*, align 4
  %matC.addr = alloca %struct.output_window*, align 4
  %i = alloca i32, align 4
  %B = alloca i16, align 2
  store %struct.input_window* %matB, %struct.input_window** %matB.addr, align 4, !tbaa !104

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 11.0.0 (sgasip@krachtcs10:ipd/repositories/llvm_ipd 8ae012ed2b4731889ba2efbfb1dacc610b3ce588)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/Jinming/research/aie_project/n2n/aie/n2n_trans2.cc", directory: "/home/Jinming/research/aie_project/n2n/Work/aie/ir")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "aie_dm_resource", file: !4, line: 370, baseType: !5, size: 32, flags: DIFlagEnumClass, elements: !6, identifier: "_ZTS15aie_dm_resource")
!4 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/data/versal_prod/lib/me_defines.h", directory: "")
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "none", value: 0)
!8 = !DIEnumerator(name: "a", value: 1)
!9 = !DIEnumerator(name: "b", value: 2)
!10 = !DIEnumerator(name: "c", value: 3)
!11 = !DIEnumerator(name: "d", value: 4)
!12 = !DIEnumerator(name: "stack", value: 5)
!13 = !{!14, !64, !65, !66}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "T", scope: !17, file: !16, line: 836, baseType: !58)
!16 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/include/adf/window/window.h", directory: "")
!17 = distinct !DISubprogram(name: "window_readincr<aie_dm_resource::none>", linkageName: "_ZL15window_readincrIL15aie_dm_resource0EEvP12input_windowIsERs", scope: !16, file: !16, line: 836, type: !18, scopeLine: 836, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, templateParams: !56, retainedNodes: !53)
!18 = !DISubroutineType(types: !19)
!19 = !{null, !20, !49}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "input_window_int16", file: !16, line: 100, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_window<short>", file: !16, line: 61, size: 416, flags: DIFlagTypePassByValue, elements: !23, templateParams: !46, identifier: "_ZTS12input_windowIsE")
!23 = !{!24, !26, !27, !35, !36, !40, !41, !42, !43, !44}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !22, file: !16, line: 63, baseType: !25, size: 32)
!25 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !22, file: !16, line: 64, baseType: !25, size: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !22, file: !16, line: 65, baseType: !28, size: 32, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "window_datatype", file: !31, line: 8, baseType: !32)
!31 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/include/adf/window/window_internal.h", directory: "")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !33, line: 23, baseType: !34)
!33 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/data/versal_prod/lib/runtime/include/stdint.h", directory: "")
!34 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !22, file: !16, line: 66, baseType: !28, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !22, file: !16, line: 67, baseType: !37, size: 64, offset: 128)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 2)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !22, file: !16, line: 68, baseType: !28, size: 32, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !22, file: !16, line: 69, baseType: !37, size: 64, offset: 224)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !22, file: !16, line: 70, baseType: !25, size: 32, offset: 288)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !22, file: !16, line: 71, baseType: !25, size: 32, offset: 320)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !22, file: !16, line: 75, baseType: !45, size: 64, offset: 352)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !38)
!46 = !{!47}
!47 = !DITemplateTypeParameter(name: "T", type: !48)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16", file: !51, line: 14, baseType: !52)
!51 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/include/adf/window/types.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !33, line: 24, baseType: !48)
!53 = !{!54, !55}
!54 = !DILocalVariable(name: "w", arg: 1, scope: !17, file: !16, line: 836, type: !20)
!55 = !DILocalVariable(name: "value", arg: 2, scope: !17, file: !16, line: 836, type: !49)
!56 = !{!57}
!57 = !DITemplateValueParameter(name: "Resource", type: !3, value: i32 0)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "aie_dm_resource_set_t<int16, (aie_dm_resource)0>", file: !59, line: 264, baseType: !60)
!59 = !DIFile(filename: "/opt/tools/xilinx/Vitis/2021.1/aietools/data/versal_prod/lib/aie_core.h", directory: "")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "type", scope: !61, file: !59, line: 254, baseType: !48)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aie_dm_resource_set<short, aie_dm_resource::none>", file: !59, line: 252, size: 8, flags: DIFlagTypePassByValue, elements: !62, templateParams: !63, identifier: "_ZTS19aie_dm_resource_setIsL15aie_dm_resource0EE")
!62 = !{}
!63 = !{!47, !57}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "T", scope: !68, file: !16, line: 836, baseType: !58)
!68 = distinct !DISubprogram(name: "window_writeincr<aie_dm_resource::none>", linkageName: "_ZL16window_writeincrIL15aie_dm_resource0EEvP13output_windowIsEs", scope: !16, file: !16, line: 836, type: !69, scopeLine: 836, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, templateParams: !56, retainedNodes: !85)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !50}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_window_int16", file: !16, line: 110, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "output_window<short>", file: !16, line: 80, size: 416, flags: DIFlagTypePassByValue, elements: !74, templateParams: !46, identifier: "_ZTS13output_windowIsE")
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "current_bufid", scope: !73, file: !16, line: 82, baseType: !25, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "instanceId", scope: !73, file: !16, line: 83, baseType: !25, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !73, file: !16, line: 84, baseType: !28, size: 32, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !73, file: !16, line: 85, baseType: !28, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !73, file: !16, line: 86, baseType: !37, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !73, file: !16, line: 87, baseType: !28, size: 32, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !73, file: !16, line: 88, baseType: !37, size: 64, offset: 224)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !73, file: !16, line: 89, baseType: !25, size: 32, offset: 288)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "winsize", scope: !73, file: !16, line: 90, baseType: !25, size: 32, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lockids", scope: !73, file: !16, line: 94, baseType: !45, size: 64, offset: 352)
!85 = !{!86, !87}
!86 = !DILocalVariable(name: "w", arg: 1, scope: !68, file: !16, line: 836, type: !71)
!87 = !DILocalVariable(name: "value", arg: 2, scope: !68, file: !16, line: 836, type: !50)
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = !{!"clang version 11.0.0 (sgasip@krachtcs10:ipd/repositories/llvm_ipd 8ae012ed2b4731889ba2efbfb1dacc610b3ce588)"}
!92 = distinct !DISubprogram(name: "n2n_trans2", linkageName: "_Z10n2n_trans2P12input_windowIsEP13output_windowIsE", scope: !93, file: !93, line: 5, type: !94, scopeLine: 6, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !96)
!93 = !DIFile(filename: "aie/n2n_trans2.cc", directory: "/home/Jinming/research/aie_project/n2n")
!94 = !DISubroutineType(types: !95)
!95 = !{null, !20, !71}
!96 = !{!97, !98, !99, !101}
!97 = !DILocalVariable(name: "matB", arg: 1, scope: !92, file: !93, line: 5, type: !20)
!98 = !DILocalVariable(name: "matC", arg: 2, scope: !92, file: !93, line: 6, type: !71)
!99 = !DILocalVariable(name: "i", scope: !100, file: !93, line: 8, type: !5)
!100 = distinct !DILexicalBlock(scope: !92, file: !93, line: 8, column: 3)
!101 = !DILocalVariable(name: "B", scope: !102, file: !93, line: 9, type: !50)
!102 = distinct !DILexicalBlock(scope: !103, file: !93, line: 8, column: 26)
!103 = distinct !DILexicalBlock(scope: !100, file: !93, line: 8, column: 3)
!104 = !{!105, !105, i64 0, i64 4}
!105 = !{!106, i64 4, !"any pointer"}
!106 = !{!107, i64 1, !"omnipotent char"}
!107 = !{!"Simple C++ TBAA"}
!108 = !DILocation(line: 5, column: 37, scope: !92)
!109 = !DILocation(line: 6, column: 23, scope: !92)
!110 = !DILocation(line: 8, column: 8, scope: !100)
!111 = !DILocation(line: 8, column: 12, scope: !100)
!112 = !{!113, !113, i64 0, i64 4}
!113 = !{!106, i64 4, !"int"}
!114 = !DILocation(line: 8, column: 16, scope: !103)
!115 = !DILocation(line: 8, column: 17, scope: !103)
!116 = !DILocation(line: 8, column: 3, scope: !100)
!117 = !DILocation(line: 8, column: 3, scope: !103)
!118 = !DILocation(line: 9, column: 4, scope: !102)
!119 = !DILocation(line: 9, column: 10, scope: !102)
!120 = !DILocation(line: 9, column: 28, scope: !102)
!121 = !DILocation(line: 9, column: 12, scope: !102)
!122 = !{!123, !123, i64 0, i64 2}
!123 = !{!106, i64 2, !"short"}
!124 = !DILocation(line: 10, column: 22, scope: !102)
!125 = !DILocation(line: 10, column: 27, scope: !102)
!126 = !DILocation(line: 10, column: 5, scope: !102)
!127 = !DILocation(line: 11, column: 3, scope: !103)
!128 = !DILocation(line: 11, column: 3, scope: !102)
!129 = !DILocation(line: 8, column: 23, scope: !103)
!130 = distinct !{!130, !116, !131}
!131 = !DILocation(line: 11, column: 3, scope: !100)
!132 = !DILocation(line: 13, column: 1, scope: !92)
!133 = distinct !DISubprogram(name: "window_readincr<aie_dm_resource::none>", linkageName: "_ZL15window_readincrIL15aie_dm_resource0EEsP12input_windowIsE", scope: !16, file: !16, line: 836, type: !134, scopeLine: 836, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, templateParams: !56, retainedNodes: !136)
!134 = !DISubroutineType(types: !135)
!135 = !{!50, !20}
!136 = !{!137, !138}
!137 = !DILocalVariable(name: "w", arg: 1, scope: !133, file: !16, line: 836, type: !20)
!138 = !DILocalVariable(name: "value", scope: !133, file: !16, line: 836, type: !50)
!139 = !DILocation(line: 836, column: 3, scope: !133)
!140 = !{!141}
!141 = distinct !{!141, !142, !"_ZL16window_writeincrIL15aie_dm_resource0EEvP13output_windowIsEs: unknown scope"}
!142 = distinct !{!142, !"_ZL16window_writeincrIL15aie_dm_resource0EEvP13output_windowIsEs"}
!143 = !DILocation(line: 836, column: 3, scope: !68)
!144 = !{!145, !105, i64 8, i64 4}
